--- a/docs/developer/proposal/EP_004-ACPI-support.md
+++ b/docs/developer/proposal/EP_004-ACPI-support.md
@@ -58,30 +58,26 @@ Not all nodes have Redfish for getting platform power metrics, so this proposal 
 Add ACPI option which is an alternative of Redfish to Kepler.
 ACPI can collect platform power metrics from reading sysfs. The platform collector is able to reuse the one that Redfish uses if merged.
 
-```text
-┌─────────────────┐    ┌───────────────────┐
-│   CPU Power     │    │  Platform Power   │
-│   (RAPL)        │    │ (Redfish or ACPI) │
-└─────────────────┘    └───────────────────┘
-         │                        │
-         ▼                        ▼
-┌─────────────────┐    ┌────────────────────┐
-│ Power Monitor   │    │ Power Monitor      │
-│ (Attribution)   │    │ (For ACPI,         │
-│                 │    │ no attribution)    │
-└─────────────────┘    └────────────────────┘
-         │                        │
-         ▼                        ▼
-┌─────────────────┐    ┌────────────────────┐
-│ Power Collector │    │ Platform Collector │
-│                 │    │                    │
-└─────────────────┘    └────────────────────┘
-         └──────────┬─────────────┘
-                    ▼
-           ┌──────────────────┐
-           │ Prometheus       │
-           │ Exporter         │
-           └──────────────────┘
+```mermaid
+graph TB
+  CPUPowerMeter[CPU Power Meter]
+  PowerMonitorNode[Power Monitor **With** attribution]
+  PlatformPowerMeter[Platform Power Meter with ACPI]
+  PowerMonitorPlatform[Power Monitor **Without** attribution]
+  PowerCollector[Power Collector]
+  PlatformCollector[Platform Collector]
+  PromExporter[Prometheus Exporter]
+
+  CPUPowerMeter --> PowerMonitorNode --> PowerCollector --> PromExporter
+  PlatformPowerMeter --> PowerMonitorPlatform --> PlatformCollector --> PromExporter
+
+  style CPUPowerMeter fill:#1e88e5,color:#fff
+  style PlatformPowerMeter fill:#1e88ff,color:#fff
+  style PowerMonitorNode fill:#43a047,color:#fff
+  style PowerMonitorPlatform fill:#43a067,color:#fff
+  style PowerCollector fill:#fb8c00,color:#fff
+  style PlatformCollector fill:#f57c00,color:#fff
+  style PromExporter fill:#8e24aa,color:#fff
 ```
 
 ### Aggregate power metrics
